Org2Blog.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2016-09-01 Thu 19:23 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title></title>
<meta name="generator" content="Org-mode">
<meta name="author" content="Grant Rettke">
</head>
<body>
<div id="content">

<div id="outline-container-org66d7309" class="outline-2">
<h2 id="org66d7309"><a id="orgmode:gcr:vela:BA37913C-D781-453B-B438-F6464B60CFDF"></a><span class="section-number-2">1</span> Org2blog</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
ID: orgmode:gcr:vela:BA37913C-D781-453B-B438-F6464B60CFDF
</pre>

<p>
Configure Org2blog for use, development, and support.
</p>

<p>
Sysop is likely to use this periodically.
</p>

<p>
Start EMACS with this command:
</p>

<p>
<code>open /Applications/Emacs.app -n --args --quick --load ~/src/help/.org-mode-org2blog.emacs.el</code>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="orgc57ecdd"><span class="org-comment-delimiter">;; </span><span class="org-comment">-*- lexical-binding: t -*-</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="orgdc16095">(load-file <span class="org-string">"~/src/help/.org-mode-fundamentals.emacs.el"</span>)
</pre>
</div>
</div>

<div id="outline-container-orga218085" class="outline-3">
<h3 id="orga218085"><a id="orgmode:gcr:vela:59073E74-83D9-4218-917C-789A27D57E5A"></a><span class="section-number-3">1.1</span> Watch What You Eat</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
ID: orgmode:gcr:vela:59073E74-83D9-4218-917C-789A27D57E5A
</pre>

<p>
<b>Code requiring package-management can only follow this block.</b>
</p>

<p>
Before ELPA, I used SVN to manage software packages for EMACS. After ELPA,
I used ELPA-packages. Now this system uses MELPA and GNU. MELPA packages always
have their issues fixed very quickly. GNU packages rarely have issues.
</p>

<p>
Initialize Package.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org16ef806">(package-initialize)
(add-to-list 'package-archives
             '(<span class="org-string">"melpa"</span> . <span class="org-string">"http://melpa.org/packages/"</span>) t)
(add-to-list 'package-archives
             '(<span class="org-string">"gnu"</span> . <span class="org-string">"http://elpa.gnu.org/packages/"</span>) t)
</pre>
</div>

<p>
Use-Package is the most configurable and performant way to manage ELPA packages.
</p>

<p>
Add the Use-Package distribution the load path.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="orga1d98a9">(add-to-list 'load-path<span class="org-string">"~/src/use-package"</span>)
</pre>
</div>

<p>
Load Use-Package and it&rsquo;s partner Diminish. Every package loaded before this
point uses <code>require</code>. Every package loaded after this point uses <code>use-package</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org2a9f6e4">(<span class="org-keyword">eval-when-compile</span>
  (<span class="org-keyword">require</span> '<span class="org-constant">use-package</span>))
(<span class="org-keyword">use-package</span> <span class="org-constant">diminish</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org02f8a27" class="outline-3">
<h3 id="org02f8a27"><a id="orgmode:gcr:vela:F5E33EB2-2E26-435C-85F6-26CB7CE7FC56"></a><span class="section-number-3">1.2</span> Blog</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
ID: orgmode:gcr:vela:F5E33EB2-2E26-435C-85F6-26CB7CE7FC56
</pre>

<blockquote>
<p>
An elisp implementation of clientside XML-RPC
</p>
</blockquote>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org2c7e0ff">(<span class="org-keyword">use-package</span> <span class="org-constant">xml-rpc</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<blockquote>
<p>
Weblog maintenance via XML-RPC APIs
</p>
</blockquote>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org7435043">(<span class="org-keyword">use-package</span> <span class="org-constant">metaweblog</span>
  <span class="org-builtin">:ensure</span> t)
</pre>
</div>

<blockquote>
<p>
Blog from Org mode to wordpress
</p>
</blockquote>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org40acbf1">(add-to-list 'load-path <span class="org-string">"~/src/org2blog"</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">org2blog-autoloads</span>)
</pre>
</div>

<p>
Org2Blog depends on Org-Mode. This system loads Org-Mode from Git. Enter the
<code>ELPA</code> cache directory and delete it.
</p>

<p>
This system works with WisdomAndWonder. It keeps its posts separate giving focus
to each Web.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org897af1f">(setq org2blog/wp-track-posts nil)
</pre>
</div>

<p>
Configure Org2Blog.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org69daaa1">(setq org2blog/wp-blog-alist
      '((<span class="org-string">"wisdomandwonder"</span>
         <span class="org-builtin">:url</span> <span class="org-string">"https://www.wisdomandwonder.com/xmlrpc.php"</span>
         <span class="org-builtin">:username</span> <span class="org-string">"admin"</span>
         <span class="org-builtin">:default-categories</span> (<span class="org-string">"Article"</span> <span class="org-string">"Link"</span>)
         <span class="org-builtin">:confirm</span> t
         <span class="org-builtin">:show</span> 'show)))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Grant Rettke</p>
<p class="date">Created: 2016-09-01 Thu 19:23</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
